Start

In [3]:
import pandas as pd
import numpy as np

In [5]:
df= pd.read_csv("chipotle.csv")

In [7]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [11]:
df.shape #kiem tra df co bao nhieu dong va cot

(999, 5)

In [13]:
df.info() #kieu du lieu cua tung cot

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            999 non-null    int64
 1   quantity            999 non-null    int64
 2   item_name           999 non-null    object
 3   choice_description  751 non-null    object
 4   item_price          999 non-null    object
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

In [19]:
df.columns #tra ve cac ten cot dang object
#list(df.columns) => tra ve cac ten cot dang chuoi
#df.index =>kiem tra data duoc danh index tu so may den so may va buoc nhay

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [23]:
#df.describe() #=>tra ve cac cot co kieu du lieu int
#=> muon thong ke duoc tat ca cac cot du khong co kieu DL int
df.describe(include = "all")

          order_id    quantity        item_name choice_description item_price
count   999.000000  999.000000              999                751        999
unique         NaN         NaN               44                376         47
top            NaN         NaN  Chicken Burrito        [Diet Coke]     $8.75
freq           NaN         NaN              125                 28        133
mean    208.761762    1.063063              NaN                NaN        NaN
std     116.907408    0.266776              NaN                NaN        NaN
min       1.000000    1.000000              NaN                NaN        NaN
25%     108.500000    1.000000              NaN                NaN        NaN
50%     209.000000    1.000000              NaN                NaN        NaN
75%     309.000000    1.000000              NaN                NaN        NaN
max     410.000000    3.000000              NaN                NaN        NaN

Loc (location) va iloc(index location)

In [40]:
#df.loc[df.quantity == 3] #=> loc ra nhung hang co quantity = 3
#vd khac them dieu kien: 
df.loc[(df.quantity == 3) | (df.item_name == "Nantucket Nectar"), ['order_id','quantity','item_name']]
#=>loc ra nhung hang co quantity = 3 hoac cot item_name co gtri =Nantucket Nectar. 
#Sau dau phay ['order_id','quantity','item_name	'] la dien ten cot thoa dieu kien muon hien thi, cac cot khong duoc ghi se bi an

     order_id  quantity          item_name
2           1         1   Nantucket Nectar
22         11         1   Nantucket Nectar
105        46         1   Nantucket Nectar
173        77         1   Nantucket Nectar
205        91         1   Nantucket Nectar
409       178         3       Chicken Bowl
436       189         1   Nantucket Nectar
445       193         3               Bowl
601       247         2   Nantucket Nectar
689       284         3  Canned Soft Drink
818       338         3      Bottled Water
850       350         3  Canned Soft Drink
917       379         3  Canned Soft Drink
925       381         1   Nantucket Nectar

In [50]:
#df.iloc[9] #=> tra ve gia tri cac cot cua dong thu 10 (vi index danh tu 0)
#=> tra ve dang series
df.iloc[[9]] #=> tra ve kieu data frame
#df.iloc[3:11] #=> tra ve tu index 3 den index 10

,order_id,quantity,item_name,choice_description,item_price
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [56]:
df.iloc[3:5, :-1] #tra cac cot cua dong index 3 va 4 (tru cot cuoi cung(-1))
#=> muon tra ve duy nhat cot cuoi cung cua dong index 3 va 4
#df.iloc[3:5, -1]

,order_id,quantity,item_name,choice_description
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans..."

Data Manipulation (lam viec voi DL trong data frame)

In [59]:
df.item_price.dtype #=>dtype('O') o:object
#=>can chuyen qua DL so de de xu ly

dtype('O')

Apply()

In [65]:
#df.item_price.apply(lambda x: x.replace('$', ''))
#ham lambda: goi x la gtri cua cot item_price. Thay the chu $ trong x bang '' (tuc la thay the bang rong khong co gi het)
#=> van la kieu DL object
df.item_price.apply(lambda x: float(x.replace('$', '')))
#=> them float ep kieu DL
#==> chi thay doi nhat thoi khi chi print minh cot do. Neu print df.head() no van co $ phia truoc nhu cu

0       2.39
1       3.39
2       3.39
3       2.39
4      16.98
       ...
994    11.25
995     8.49
996    10.98
997     8.75
998     1.25
Name: item_price, Length: 999, dtype: float64

In [67]:
#=> gan no cho df de print df no thay doi luon (thay doi tren data frame chu khong thay doi nhat thoi nua)
df.item_price = df.item_price.apply(lambda x: float(x.replace('$', '')))
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

TAO COLUMN MOI

In [84]:
df["total_price"] = df["quantity"] * df["item_price"]
#cach 2: 
#df.total_price = df.quantity * df.item_price
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

HOW MUCH WAS REVENUE FOR THE PERIOD IN THE DATASET? (tong doanh thu trong dataset?)

In [87]:
revenue = df.total_price.sum()
print(revenue)

8266.730000000001

WHICH WAS THE MOST-ORDERED ITEM?

In [95]:
item = df.groupby("item_name")["quantity"].sum()
item.sort_values(ascending = False).head(5) #> false sap xep tu z -> a

item_name
Chicken Burrito        127
Chicken Bowl           127
Chips and Guacamole    113
Steak Burrito           97
Canned Soft Drink       66
Name: quantity, dtype: int64

TIM UNIQUE VALUE (GIA TRI DUY NHAT)

In [99]:
#df.item_name.value_counts().count() #=> co bao nhieu mac hang duoc ban ra
#cach 2:
df.item_name.nunique()

44